testedt/src/Documents/ЗарплатаКВыплате/ЗарплатаКВыплате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗарплатаКВыплате</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

testedt/src/AccumulationRegisters/ВзаиморасчетыССотрудниками/ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.ОсновныеНачисления</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

testedt/src/Documents/ЗарплатаКВыплате/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗаполнитьОстатками(Команда)
	
	Если Объект.Проведен Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Для заполнения требуется отменить проведение документа.";
		Сообщение.Сообщить();
		Возврат;	
	КонецЕсли;  
	
	Объект.СписокСотрудников.Очистить();
	ЗаполнитьОстаткамиНаСервере();   
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткамиНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
		|	ВзаиморасчетыССотрудникамиОстатки.ВидРасчета КАК ВидРасчета,
		|	СУММА(ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыССотрудниками.Остатки(&Период, Подразделение = &Подразделение) КАК ВзаиморасчетыССотрудникамиОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзаиморасчетыССотрудникамиОстатки.Сотрудник,
		|	ВзаиморасчетыССотрудникамиОстатки.ВидРасчета";
	
	Запрос.УстановитьПараметр("Период", Новый Граница(КонецМесяца(Объект.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(Объект.СписокСотрудников.Добавить(), Выборка);
	КонецЦикла;

КонецПроцедуры
